app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')
---
  def index
    @sort_by = params[:sort_by]
    @ratings = params[:ratings]
    @ratings_ary = @ratings ? @ratings.keys : @all_ratings
    @movies = Movie.where(:rating => @ratings_ary).order(@sort_by)  end